from enum import Enum


class HTTP(object):
    HTTP_100_CONTINUE = 100  # 继续
    HTTP_101_SWITCHING_PROTOCOLS = 101  # 交换协议
    HTTP_200_OK = 200  # 查询请求成功
    HTTP_201_CREATED = 201  # 创建成功
    HTTP_202_ACCEPTED = 202  # 接受
    HTTP_203_NON_AUTHORITATIVE_INFORMATION = 203  # 非权威的信息
    HTTP_204_NO_CONTENT = 204  # 没有内容
    HTTP_205_RESET_CONTENT = 205  # 重置内容
    HTTP_206_PARTIAL_CONTENT = 206  # 部分内容
    HTTP_207_MULTI_STATUS = 207  # 多状态
    HTTP_300_MULTIPLE_CHOICES = 300  # 多个选择
    HTTP_301_MOVED_PERMANENTLY = 301  # 永久重定向
    HTTP_302_FOUND = 302  # 发现
    HTTP_303_SEE_OTHER = 303  # 重定向到其他
    HTTP_304_NOT_MODIFIED = 304  # 未修改
    HTTP_305_USE_PROXY = 305  # 使用代理
    HTTP_306_RESERVED = 306  # 未使用
    HTTP_307_TEMPORARY_REDIRECT = 307  # 临时重定向
    HTTP_400_BAD_REQUEST = 400  # 错误的请求
    HTTP_401_UNAUTHORIZED = 401  # 未经授权
    HTTP_402_PAYMENT_REQUIRED = 402  # 需要授权
    HTTP_403_FORBIDDEN = 403  # 禁止访问
    HTTP_404_NOT_FOUND = 404  # 没有找到
    HTTP_405_METHOD_NOT_ALLOWED = 405  # 方法不允许
    HTTP_406_NOT_ACCEPTABLE = 406  # 不可接受
    HTTP_407_PROXY_AUTHENTICATION_REQUIRED = 407  # 代理省份验证
    HTTP_408_REQUEST_TIMEOUT = 408  # 请求超时
    HTTP_409_CONFLICT = 409  # 资源冲突
    HTTP_410_GONE = 410  # 资源存在但是不可用了
    HTTP_411_LENGTH_REQUIRED = 411  # 没有定义content-length
    HTTP_412_PRECONDITION_FAILED = 412  # 前提条件失败
    HTTP_413_REQUEST_ENTITY_TOO_LARGE = 413  # 请求包太大
    HTTP_414_REQUEST_URI_TOO_LONG = 414  # 请求url太长
    HTTP_415_UNSUPPORTED_MEDIA_TYPE = 415  # 不支持的媒体类型
    HTTP_416_REQUESTED_RANGE_NOT_SATISFIABLE = 416  # 请求范围不足
    HTTP_417_EXPECTATION_FAILED = 417  # 预期失败
    HTTP_422_UNPROCESSABLE_ENTITY = 422  # 不可加工
    HTTP_423_LOCKED = 423  # 被锁定
    HTTP_424_FAILED_DEPENDENCY = 424  # 失败的依赖
    HTTP_425_TOO_EARLY = 425  # 言之过早
    HTTP_428_PRECONDITION_REQUIRED = 428  # 先决条件要求
    HTTP_429_TOO_MANY_REQUESTS = 429  # 请求太多
    HTTP_431_REQUEST_HEADER_FIELDS_TOO_LARGE = 431  # 请求头字段太大
    HTTP_451_UNAVAILABLE_FOR_LEGAL_REASONS = 451  # 由于法律原因无法使用
    HTTP_500_INTERNAL_SERVER_ERROR = 500  # 服务器错误
    HTTP_501_NOT_IMPLEMENTED = 501  # 没有实现
    HTTP_502_BAD_GATEWAY = 502  # 网关错误
    HTTP_503_SERVICE_UNAVAILABLE = 503  # 服务不可用
    HTTP_504_GATEWAY_TIMEOUT = 504  # 网关超时
    HTTP_505_HTTP_VERSION_NOT_SUPPORTED = 505  # HTTP协议版本不支持
    HTTP_507_INSUFFICIENT_STORAGE = 507  # 存储不足
    HTTP_511_NETWORK_AUTHENTICATION_REQUIRED = 511  # 网络身份验证要求


class CrtConstant(object):
    # device文件导入时若无psn，则通过国标码转内部编码后进行存储, rj45 未导入设备类型判断
    DEVICE_TYPE_DICT = {
        '1': ['14', '火灾报警控制器/火灾报警控制器(联动型)'],
        '2': ['14', '主机'],
        '10': ['11', '火灾显示盘'],
        '11': ['20', '探测回路'],
        '13': ['15', '主电源'],
        '14': ['16', '备用电源'],
        '21': ['2', '感烟火灾探测器'],
        '23': ['2', '感烟火灾探测器'],
        '31': ['3', '点型感温火灾探测器'],
        '50': ['4', '烟温复合探测器'],
        '61': ['5', '手动报警按钮'],
        '62': ['6', '消火栓按钮'],
        '72': ['7', '输入模块'],
        '74': ['9', '输入/输出模块'],
        '75': ['13', '中继模块'],
        '76': ['12', '短路隔离器'],
        '82': ['10', '火灾声光警报器'],
        '85': ['40', '气体释放警报器'],
        '100': ['32', '可燃气体报警控制器'],
        '101': ['33', '可燃气体探测器'],
        '110': ['29', '电气火灾监控设备'],
        '112': ['31', '剩余电流式电气火灾监控探测器'],
        '113': ['30', '测温式电气火灾监控探测器'],
        '120': ['49', '应急照明控制器'],
        '121': ['58', '消防应急标志灯具'],
        '122': ['52', '消防应急照明灯具'],
        '123': ['74', '消防应急灯具专用应急电源'],
        '124': ['73', '应急照明分配电装置'],
        '130': ['22', '防火门监控器'],
        '133': ['84', '防火门电动闭门器'],
        '135': ['78', '防火门门磁开关'],
        '140': ['25', '消防设备电源监控器'],
        '141': ['28', '消防设备电源电压信号传感器'],
        '143': ['26', '消防设备电源电压／电流信号传感器'],
        '150': ['36', '气体灭火控制器'],
        '256': ['48', '广播模块1403'],
        '257': ['27', '三相电源电压电流探测器'],
        '260': ['87', '组合式电气火灾监控探测器'],
        '261': ['88', '紧急启停按钮'],
        '262': ['181', '应急照明集中电源回路板'],
        '263': ['182', '应急照明集中电源电源板'],
        '264': ['125', '双路三相电源电压电流探测器'],
        '265': ['126', '家用有线控制器'],
        '266': ['128', '家用点型观点感烟探测器'],
        '267': ['129', '家用点型感温探测器'],
        '268': ['201', '家用手动报警开关'],
        '351': ['34', '天然气可燃气体探测器'],
        '361': ['223', '气灭盘'],
        '1009': ['1', '报警总线节点'],
        '1012': ['4', '烟温复合探测器'],
        '1017': ['9', '四线输出模块'],
        '1033': ['17', '专线盘'],
        '1034': ['18', '专线现场模块'],
        '1035': ['19', '总线盘'],
        '1041': ['21', '回路母板'],
        '127': ['82', '火灾声光警报器'],

        '300': ['300', 'NB-IoT感烟火灾探测器'],
        '301': ['301', 'NB-IoT感温火灾探测器'],
        '302': ['302', 'NB-IoT天然气探测器'],
        '303': ['303', 'NB-IoT液化气探测器'],
        '304': ['304', '家用无线控制器'],
        '305': ['305', 'Lora无线感烟探测器'],
        '306': ['306', 'Lora无线感温探测器'],
        '307': ['307', 'Lora无线手动报警按钮'],
        '308': ['308', 'Lora无线声光警报器'],
        '309': ['309', 'Lora天然气探测器'],
        '310': ['310', 'Lora液化气探测器'],
        '311': ['311', 'Lora无线输入输出模块'],
        '312': ['312', 'NB-IoT无线压力探测器'],
        '313': ['313', 'NB-IoT无线液位探测器'],
        '314': ['314', 'NB-IoT无线水浸探测器'],
        '315': ['315', 'NB-IoT组合式电气火灾监控探测器'],
        '316': ['316', 'NB-IoT无线输入输出模块'],
    }
    # can中设备类型不准确时使用此进行转化，设备类型正确后的控制器注销下属字典
    CAN_DEVICE_TYPE_DICT = {
        '1': ['', '设备'],
        '2': ['', '火灾报警控制器'],
        '4': ['', '充电板'],
        '5': ['', '按键盘'],
        '9': ['', '报警总线节点'],

        '10': ['', '感烟探测器'],
        '11': ['', '感温探测器'],
        '12': ['', '烟温复合探测器'],
        '13': ['', '手动报警按钮'],
        '14': ['', '消火栓按钮'],
        '15': ['', '输入模块'],
        '16': ['', '输入/输出模块'],
        '17': ['', '四线输出模块'],
        '18': ['', '火灾声光警报器'],
        '19': ['', '楼层显示器'],

        '20': ['', '短路隔离器'],
        '21': ['', '中继模块'],
        '22': ['', '广播模块'],
        '23': ['', '声警报器'],
        '24': ['', '光警报器'],
        '25': ['', '家报'],
        '26': ['', '家用感烟'],
        '27': ['', '家用感温'],
        '28': ['', '家用手报'],

        '30': ['', '火灾报警控制器'],
        '31': ['', '主电'],
        '32': ['', '备电'],
        '33': ['', '专线盘'],
        '34': ['', '专线模块'],
        '35': ['', '总线盘'],

        '40': ['', '报警总线回路'],
        '41': ['', '回路母板'],

        '50': ['', '防火门监控系统'],
        '51': ['', '门磁开关'],
        '52': ['', '电动闭门器'],
        '53': ['', '双门磁'],
        '56': ['', '常闭单门'],
        '57': ['', '常闭双门'],
        '58': ['', '常开单门'],
        '59': ['', '常开双门'],

        '60': ['', '消防电源监控系统'],
        '61': ['', '单相电源电压探测器'],
        '62': ['', '三相电压电流探测器'],
        '63': ['', '双路三相电压探测器'],
        '64': ['', '双路三相电压电流探测器'],
        '65': ['', '双路三相电压电流探测器'],
        '66': ['', '三相双电压单电流探测器'],

        '70': ['', '电气火灾系统'],
        '71': ['', '剩余电流探测器'],
        '72': ['', '测温式探测器'],
        '73': ['', '8路组合式探测器'],

        '80': ['', '可燃气体报警系统'],
        '81': ['', 'CO探测器'],
        '82': ['', '天然气可燃气体探测器'],
        '83': ['', '消防电源箱'],

        '90': ['', '气体灭火系统'],
        '91': ['', '紧急启停按钮'],
        '94': ['', '气体释放灯'],
        '95': ['', '气体灭火盘'],

        '100': ['', '应急疏散系统'],
        '101': ['', '应急电源'],
        '102': ['', '回路板'],
        '103': ['', '电源板'],
        '104': ['', '干接点'],
        '105': ['', '消防应急地埋灯'],
        '106': ['', '消防应急标志灯'],
        '107': ['', '消防应急照明灯'],
        '108': ['', '消防应急感应灯']
    }

    ALARM_ID_TO_NAME = {
        1: '火警',
        2: '启动',
        3: '反馈',
        4: '故障',
        5: '屏蔽',
        6: '监管',
        7: '声光故障',
        8: '声光屏蔽',
    }

    DEVICE_ALARM_STATUS = {
        1: 'fire',
        2: 'linkage',
        3: 'feedback',
        4: 'malfunction',
        5: 'shielding',
        6: 'supervise',
        7: 'vl_malfunction',
        8: 'vl_shielding',
    }

    ALARM_NAME_TO_ID = {
        '火警': 1,
        '启动': 2,
        '反馈': 3,
        '故障': 4,
        '屏蔽': 5,
        '监管': 6,
        '声光故障': 7,
        '声光屏蔽': 8

    }

    # 声光设备device_type  10: 1代火灾声光警报器  127: 2代火灾声光警报器  308: Lora无线声光警报器
    VL_DEVICE_TYPES = [10, 127, 308]

    # 国标声光设备device_type，用于未布点设备
    GBVL_DEVICE_TYPES = [82, ]

    # 设备报告事件类型type_id
    DEVICE_REPORT_TYPES = [1, 2, 3, 4, 5, 6]

    # 控制器操作事件类型type_id
    CONTROLLER_OP_TYPES = [7, ]

    # 控制器复位事件码
    CONTROLLER_RESET_CODE = [122, ]

    # tab_gb_evt_type中火警事件码+屏蔽事件码
    GB_FIRE_EVENT_CODE = [2, 3, 4, 5, 6, 7, 8, 122, 332, 333, 334, 335, 336, 337, 338, 72, 73]

    AUDIO_PATH = {
        1: 'huojing.mp3',
        2: 'liandong.mp3',
        3: 'fankui.mp3',
        4: 'guzhang.mp3',
        #     默认声音
        5: 'default.mp3',
        # 0 掉线故障声音
        0: 'guzhang.mp3',
    }

    RJ45_TO_CAN_EVENT = {
        # 火警
        "1-0-0": 3,
        # 联动
        "2-0-0": 29,
        "2-1-0": 22,
        "2-2-0": 21,
        "2-31-0": 329,
        "2-32-0": 303,
        "2-33-0": 304,
        "2-34-0": 302,
        "2-35-0": 305,
        "2-36-0": 326,
        "2-37-0": 327,
        # 反馈
        "3-0-0": 28,
        "3-1-0": 26,
        "3-2-0": 298,
        # 故障 消失
        "4-0-1": 270,
        "4-0-2": 271,
        "4-0-3": 272,
        "4-0-4": 273,
        "4-0-5": 274,
        "4-0-6": 100,
        "4-0-16": 101,
        "4-0-32": 105,
        "4-0-33": 107,
        "4-0-34": 276,
        "4-0-35": 100,
        "4-0-48": 102,
        "4-0-49": 278,
        "4-0-50": 279,
        "4-0-51": 281,
        "4-0-52": 280,
        "4-0-64": 277,
        "4-0-70": 317,  # 1路供电中断
        "4-0-71": 319,  # 1路过压
        "4-0-72": 318,  # 1路欠压
        "4-0-73": 320,  # 1路过流
        "4-0-74": 322,  # 1路错相
        "4-0-75": 321,  # 1路缺相
        "4-0-76": 317,  # 2路供电中断
        "4-0-77": 319,  # 2路过压
        "4-0-78": 318,  # 2路欠压
        "4-0-79": 320,  # 2路过流
        "4-0-80": 322,  # 2路错相
        "4-0-81": 321,  # 2路缺项
        # 故障 出现
        "4-1-1": 256,
        "4-1-2": 257,
        "4-1-3": 258,
        "4-1-4": 259,
        "4-1-5": 260,
        "4-1-6": 80,
        "4-1-16": 81,
        "4-1-32": 85,
        "4-1-33": 261,
        "4-1-34": 262,
        "4-1-35": 80,
        "4-1-48": 269,
        "4-1-49": 264,
        "4-1-50": 265,
        "4-1-51": 267,
        "4-1-52": 266,
        "4-1-64": 263,
        "4-1-70": 49,  # 1路供电中断
        "4-1-71": 51,  # 1路过压
        "4-1-72": 50,  # 1路欠压
        "4-1-73": 52,  # 1路过流
        "4-1-74": 54,  # 1路错相
        "4-1-75": 53,  # 1路缺相
        "4-1-76": 49,  # 2路供电中断
        "4-1-77": 51,  # 2路过压
        "4-1-78": 50,  # 2路欠压
        "4-1-79": 52,  # 2路过流
        "4-1-80": 54,  # 2路错相
        "4-1-81": 53,  # 2路缺项
        # 屏蔽
        "5-0-0": 73,
        "5-1-0": 72,
        # 监管
        "6-0-0": 70,  # 监管
        "6-1-0": 71,  # 监管解除
    }

    RJ45_TO_CAN_OP = {
        "1": 120,
        "2": 121,
        "16": 129,
        "17": 122,
        "18": 123,
        "32": 127,
        "33": 128,
        "48": 294,
        "49": 295,

        # "50": 42,
        # "51": 42,
        # "52": 41,
        # "53": 41,
        "54": 308,
        "55": 309,
        "56": 306,
        "57": 307,
        # "58": 308,
    }


crt_constant = CrtConstant()
